src/InformationRegisters/ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonForms/ФормаНастроекГрафикаРаботы/Ext/Form/Module.bsl
&НаКлиенте
Процедура РабочаяНеделяПриИзменении(Элемент)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура РабочийДеньПриИзменении(Элемент)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементы()
	Элементы.РабочаяНеделя.Заголовок = СтрШаблон("Рабочая неделя: %1", НаборКонстант.РабочаяНеделя);
	Элементы.РабочийДень.Заголовок = СтрШаблон("Рабочий день в часах: %1", НаборКонстант.РабочийДень);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("НастройкиИзменены");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ЗаполнитьГрафикНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьГрафикНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи";
	
	Пользователи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	РабЧасов = Константы.РабочийДень.Получить();
	РабЧасов = ?(РабЧасов = 0, 8, РабЧасов);
	
	РабДней = Константы.РабочаяНеделя.Получить();
	РабДней = ?(РабДней = 0, 5, РабДней);
	
	КолДней = Окр((КонецГода(ТекущаяДатаСеанса()) - НачалоГода(ТекущаяДатаСеанса())) / 24 /60 /60, 0, РежимОкругления.Окр15как20);
	Для День = 1 По КолДней Цикл
		Дата = НачалоГода(ТекущаяДатаСеанса()) + День * 24 * 60 * 60;

		Если ДеньНедели(Дата) > РабДней Тогда
			Продолжить;	
		КонецЕсли;
		
		Для Каждого Пользователь Из Пользователи Цикл
			Запись = РегистрыСведений.ГрафикРаботы.СоздатьМенеджерЗаписи();
			Запись.Дата = Дата;
			Запись.Пользователь = Пользователь;
			Запись.РабочихЧасов = РабЧасов;
			Запись.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
